app/controllers/full_detail_controller.rb

SELECT * FROM `personals`
SELECT * FROM `professionals`
---
  def index
	@personals = Personal.find_full_details
	@professionals = Professional.find_full_details