app/controllers/personals_controller.rb

  def index
    @personals = Personal.all
---
SELECT * FROM `personals`

  def show
    @personal = Personal.find(params[:id])
---
SELECT * FROM `personals` WHERE (`personals`.`id` = 1)

  def edit
    @personal = Personal.find(params[:id])
---
SELECT * FROM `personals` WHERE (`personals`.`id` = 1)

  def create
    @personal = Personal.new(params[:personal])

    respond_to do |format|
      if @personal.save
---
INSERT INTO `personals` (`name`, `address`, `city`, `mob`, `current_jobstatus`, `dob`, `created_at`, `twelfth_percent`, `updated_at`, `tenth_percent`, `degree`, `personal_id`, `gender`, `pin`) VALUES('Varsha', 'wrg', 'gerg', 9653626225, 'Jobless', '2010-05-12', '2010-05-12 12:59:12', 79.0, '2010-05-12 12:59:12', 85.0, 'B.Tech', NULL, 'F', 868483)

  def update
    @personal = Personal.find(params[:id])

    respond_to do |format|
      if @personal.update_attributes(params[:personal])
---
SELECT * FROM `personals` WHERE (`personals`.`id` = 1)
UPDATE `personals` SET `updated_at` = '2010-05-14 05:09:26', `address` = 'Raisoni College', `name` = 'Aakriti', `city` = 'Pune', `mob` = 9479853454 WHERE `id` = 8

  def destroy
    @personal = Personal.find(params[:id])
    @personal.destroy
---
SELECT * FROM `personals` WHERE (`personals`.`id` = 1)
DELETE FROM `personals` WHERE `id` = 1